{"sections":{"main":{"type":"page-faq-new","blocks":{"51948967-9ba6-467d-9fa4-0e3c2128661f":{"type":"accordion","settings":{"heading1":"Order Questions","question1":"Can I include a message with my giftbasket?","answer1":"<p>Yes! We do include a greeting with every gift.  Simply enter your gift message during checkout and we will include it with your order.  If you forget to add a message with your order,  just email us at orders@americangiftsandbaskets.com with your personal message and we will attempt to add it if your order has not already been processed.<\/p>","question2":"How will my GiftBasket look?","answer2":"<p>Our gift baskets are wrapped in shrink wrap, topped with a hand- made bow and packaged in air pillows. It is then placed in a 100# corrugated box and shipped UPS, FedEx or USPS depending where it is being delivered.<\/p>","question3":"What form of payment do you accept?","answer3":"<p>We accept all major credit cards and Paypal.<\/p>","question4":"Do you collect sales tax?","answer4":"<p>We only collect sales tax on any orders that is shipping to the state of New York.<\/p>","question5":"What is your return policy?","answer5":"<p>Please visit our Return Policy section for full details.<\/p>","question6":"","answer6":"","question7":"","answer7":"","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}},"24fad3bc-782a-4dc3-94ed-398e345830b3":{"type":"accordion","settings":{"heading1":"Product Questions","question1":"What is your product substitution policy?","answer1":"<p>In instances when demand outstrips supply of a particular item, we will replace it with one of equal or greater value at no additional charge.<\/p>","question2":"","answer2":"","question3":"","answer3":"","question4":"","answer4":"","question5":"","answer5":"","question6":"","answer6":"","question7":"","answer7":"","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}},"bb5f337e-2ce0-4533-9960-d1959445e0e9":{"type":"accordion","settings":{"heading1":"Shipping & Delivery","question1":"How do I know when my order has shipped?","answer1":"<p>We will automatically send you an order confirmation via email along with a tracking number when your order ships.<\/p>","question2":"Do you ship to PO Boxes, APO or FPO addresses?","answer2":"<p>Yes, we do. We ship to all Boxes, APO or FPO addresses through the United States Postal Service..<\/p>","question3":"Do you ship chocolate in the summer months?","answer3":"<p>From Mid May to Mid October we replace certain items in our gift baskets because of the heat. Certain baskets containing chocolate candy will have hard candy substitutions made.  Certain baskets will not be available during the summer months because we can not guarantee their condition when using ground shipping if the items need refrigeration.<\/p>","question4":"How quickly can my order be shipped?","answer4":"<p>Depending on the number of packages and customization most orders that are received before 1:30 PM EST can ship out the same day.  During the Holiday Season and busy times there may be a delay up to 48 business hours due to the increased volume of orders needing to be processed.<\/p><p>Business hours are Monday-Friday.  We do not process orders on weekends and our delivery options do not include weekends in the estimated delivery times.<\/p><p>Orders are shipped via UPS and\/or Fedex and also do not include weekend delivery<\/p><p>Please see our <a href=\"https:\/\/www.americangiftsandbaskets.com\/policies\/?sectionid=1515102614201-ac6ba17b-5e64#1515102508997-11b195ff-c10b\">Shipping & Deliveries<\/a> page for our shipping schedule.<\/p>","question5":"Can I cancel an order after it has shipped?","answer5":"<p>Yes, you may. However there are fees associated with cancelling an order after it has shipped.<strong>The following fees will apply:<\/strong>shipping charges to and from the destination and a 20% restocking fee. If we need to request UPS to intercept the delivery there is an additional $12.50 fee.<\/p>","question6":"What happens if my gift gets lost or damaged in transit?","answer6":"<p>If your Gift Basket arrives damaged or does not arrive at all please contact us immediately.<\/p><p>All damage claims must be filed in writing via email within 3 business days of the gift being received. Damaged Claims that are several weeks old will not be honored under any circumstances.<\/p><p>Refunds take up to 7 days to be issued since AG&B has to file a claim with our Courier which can take 3-5 business days for processing. We ask that you place another paid order until your refund can be issued for the damaged\/lost order. Otherwise AG&B will issue a no-charge reshipment once a claim has been completed and not before.<\/p><p>Please see our <a href=\"https:\/\/www.americangiftsandbaskets.com\/policies\/?sectionid=1515102614201-ac6ba17b-5e64#1515102614201-ac6ba17b-5e64\">Refunds & Claims<\/a> page for further details and instructions.<\/p>","question7":"Shipping \/ Delivering Gift Baskets with Alcohol","answer7":"<p>Wine–Due to various state regulations, gift baskets containing wine may <strong>NOT <\/strong>be shipped to the following states: <strong>Alabama, Arkansas, Delaware, Kentucky, Mississippi, Oklahoma, Pennsylvania, South Dakota and Utah.<\/strong><\/p><p>**Note: Gift items that contain alcohol require a signature of an adult 21 years of age or older upon delivery.<\/p>","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}},"17ee31eb-22d8-4a68-830f-36b5ef6e3576":{"type":"accordion","settings":{"heading1":"Concierge – Las Vegas Hotel Delivery","question1":"How will my order ship to Las Vegas?","answer1":"<p>Orders placed before noon are shipped same day for delivery Next-Day by local courier.<\/p>","question2":"How will my order be delivered to the Hotel?","answer2":"<p>Each Hotel has it’s own gift basket delivery policy in place that we strongly adhere to. These procedures vary greatly from property to property.  Due to the privacy policies of each hotel, and out of respect for the guests, we at times are not given the guests hotel room number and are required to leave the gifts at the Concierge Desk, Guest Services or Bell Desk (depending on the hotel).<\/p><p>1. AG&B receives a signature upon successful delivery at the property and considers the delivery of the order complete.<\/p><p>2. It is then left up to the Hotel to deliver the Gift Basket to the Guests Room.  AG&B cannot control what happens to Gift Baskets once they have been delivered and signed for by the Hotel and therefore cannot be held responsible for gifts that are lost, stolen or not delivered the the rooms by hotel staff.<\/p><p>3. If a gift is not delivered in a timely manner, we strongly advise the purchaser to contact the hotel in question, as we have no control over the hotel properties delivery process or procedures they adhere to.<\/p><p>4. No Claims will be honored in the event that a guest fails to pick up their gift upon notification of it’s location in the hotel by a hotel staff member.<\/p>","question3":"","answer3":"","question4":"","answer4":"","question5":"","answer5":"","question6":"","answer6":"","question7":"","answer7":"","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}}},"block_order":["51948967-9ba6-467d-9fa4-0e3c2128661f","24fad3bc-782a-4dc3-94ed-398e345830b3","bb5f337e-2ce0-4533-9960-d1959445e0e9","17ee31eb-22d8-4a68-830f-36b5ef6e3576"],"settings":{"asidemenu":"corporate","main-heading":"<p><strong>For additional questions not found here please create a ticket via our <\/strong><a href=\"\/pages\/contact\" target=\"_blank\" title=\"Contact Us\"><strong>Contact Us<\/strong><\/a><strong> page<\/strong><\/p>"}}},"order":["main"]}