{"sections":{"main":{"type":"policies-url-tab","settings":{"asidemenu":"corporate","tab1heading":"Shipping & Deliveries","tab1content":"<ol>\n<li>All orders are shipped Monday thru Friday (excluding Holiday closures).<\/li>\n<li>\n<strong>Holiday Shipping Schedule<\/strong>:  In times of high volume processing such as National Holidays it may take an additional 24-48 hours for your order to be processed and shipped out.  Please take this into consideration when choosing your shipping options.<\/li>\n<li>\n<strong>Normal Shipping Schedule<\/strong>: <ol>\n<li>Paid orders received before 1:00 pm EST Monday thru Friday will ship that same day unless a future shipping date is requested<\/li>\n<li>Paid Orders received after 1:00 pm EST will ship on the following business day.<\/li>\n<li>Our offices are closed on the weekends.  Paid Orders placed on Saturday and Sunday will be processed on the next business day.<\/li>\n<\/ol>\n<\/li>\n<li>\n<strong>On Time Delivery<\/strong>:  When selecting your shipping option, please take the following into consideration:<ol>\n<li>The day your order is placed does NOT count as a transit day.<\/li>\n<li>Ground shipments are NOT day-definite guaranteed delivery.  Only air shipments are (3rd day, 2nd day, Next Day).<\/li>\n<li>If shipping ground, please consider that it can take up to 5 business days for delivery.<\/li>\n <li>Saturday delivery is only available for Next Day Air shipments and incurs an additional charge of $30.00 on top of the standard shipping charge.<\/li>\n<\/ol>\n<\/li>\n<li>You will be provided with an estimated delivery date on all orders. Please note that this is only an estimated delivery date; you will need to choose an expedited shipping method to guarantee a specific delivery date.  Adult signatures are required for all gifts containing alcohol.  All other gifts are sent without a required signature; occasionally the courier may determine that the location is not safe to leave an unattended package and will attempt delivery at a later date.<\/li>\n<\/ol>\n<h3>U.S. SHIPPING METHODS<\/h3>\n<p><strong>Couriers<\/strong>: We use FedEx, UPS, GSO and USPS for Domestic shipments.<\/p>\n<p>Shipping times listed on our site are estimate times provided to us by the individual carriers. We cannot be held responsible for delays out of our control at FedEx, UPS, GSO or the United States Postal Service.<\/p>\n<p>When selecting your delivery option, please take into consideration that couriers do not deliver on Saturdays and Sundays.<\/p>\n\n<h3>LAS VEGAS CONCIERGE<\/h3>\n<p>The gift baskets available for quick delivery to Las Vegas Hotels are located within in our Las Vegas Local Delivery Catalog.  Not all gifts on our site are created in Las Vegas please inquire with us before ordering a gift that is NOT in our Las Vegas Concierge Catalog.   Orders to Las Vegas Hotels placed before Noon are delivered Next-Day by local courier 6 days a week (Monday – Saturday)<\/p>\n<strong>NOTE<\/strong>:  To avoid delivery delays please provide the name of the guest under which the room reservation is made AND let us know if the gift is for someone sharing the room.\n\n<h3>DELIVERIES TO HOTELS:<\/h3>\n<p>Each property has its own delivery and privacy\/security policy in place that we are required to adhere to.  Due to these policies we are not provided access to deliver directly to a recipients room, and are required to leave deliveries at the Service Desk.<\/p>\n<p>Upon delivery to the Service Desk a signature is received and the delivery of the order is considered complete.  The property takes possession and is responsible for delivery to the recipients room.   Gifts that are lost, stolen or not delivered to the rooms by staff should be addressed directly with the property’s Service Desk.<\/p>\n\n<h3>DELIVERIES TO HOSPITALS<\/h3>:  \n<p>AG&B highly recommends that customers choose an expedited shipping method if the recipient is expecting a short hospital stay OR have the gift shipped to a recipient who can personally take the gift to the hospital recipient.<\/p>\n<p>Please be advised that we assume no responsibility for gifts becoming lost or misplaced within hospitals, failure of the hospital staff to deliver the gift to the patient’s room, or gifts arriving after a patient has been dismissed.<\/p>\n\n<h3>DELIVERY SERVICE DELAYS<\/h3>\n<p>If you live in an area experiencing an unexpected service delay (severe weather, natural disasters, unscheduled events, etc.) please add an additional 1 to 2 days to the estimated delivery date of your order.   Please also understand that these delays are delivery\/courier related issues and are out of AG&B’s control.  AG&B is not responsible for such delays and refunds cannot be processed for in such events.<\/p>\n\n<h3>AVOIDING DELAYS<h3><\/h3>\n<\/h3><p>In order to avoid delays, we urge our customers to provide complete addresses (street names, apartment #’s, city, state, zip codes) and to double check that there are no typos.  If a package is being delivered to a business, the Company Name and Department is extremely important for fast and accurate delivery.<\/p>\nWe cannot be held be responsible for delays relating to partial or incorrect information. Claims or requests for refunds on gifts returned to us or delays in shipping due to an incorrect address or missing address information (Suite numbers) will not be honored.\n<p>In the unlikely event of your parcel being denied by the recipient, your parcel will be returned to us and you will be given the option of a refund on your purchase price less applicable shipping & handling charges.<\/p>\n<ul>\n<li>\nReroute Fee: – An additional charge of $20.00 will apply if a parcel needs to be rerouted and\/or if the shipping address needs to be corrected after the parcel has shipped.<br>\n** Gifts containing alcohol cannot be rerouted due to carrier policies and will be returned to our facility. **<\/li>\n<li>Refused\/Failed Deliveries are returned to our facility and will incurr additional shipping charges.<\/li>\n<\/ul>\n<h3>INTERNATIONAL DELIVERY<\/h3>\n<p>AG&B delivers to all 50 United States. We cannot ship to APO – FPO Boxes or foreign addresses.<\/p>\n<p>All gifts are available for shipping to Hawaii and Alaska.  During checkout you will be offered a Alaska and Hawaii shipping option to select.<\/p>\n\n<h3>MULTIPLE ORDERS<\/h3>:\n<p>Products cannot be bundled into a single package due to design and size.  Shipping rates are per item ordered.  If you need to order large multiple items 5 or more please Contact Us for Bulk Shipping rates.<\/p>\n\n \n\n<h3>ALCOHOL SHIPPING:<\/h3>\n<p>All shipments of alcohol require a signature upon delivery by an adult 21 years of age or older.  AG&B will not be responsible for delivery delays due to signature receipt requirements not being met.  Damage to basket contents and spoilage claims will not be honored in the event of a delivery delay resulting from authorized adult signature failure. We highly recommend that our customers notify the gift recipients of the shipment and notify them that a signature of a person 21 years of age or older is required for package delivery.<\/p>\n<p>Our wine, beer and champagne gift baskets are shipped directly from our network of suppliers. Due to current state laws, some states do not permit the shipping of alcohol into their state. If we receive an order for one of the states that has these restrictions in place, we will contact you immediately to discuss your order.<\/p>","tab2heading":"Payments & Sales Tax","tab2content":"<strong>Accepted Payment Methods<\/strong>\n<p>We accept all major credit cards;<\/p>\n<p>Net15 Terms may be available for approved Corporate Accounts only (minimum $5,000 first order).<\/p>\n\n \n\n<strong>Sales Tax Collection<\/strong>\n<p>We are a New York based company and must collect state and local taxes for shipments to New York State.<\/p>\n<p>We are obligated to collect tax in additional states if we establish a presence in those states.<\/p>\n\n<p>Sales Tax will automatically be calculated and applied to your orders<\/p>","tab3heading":"Returns & claims","tab3content":"<div>*** All Return & Claim Requests must be submitted by Creating a\nSupport Ticket Here  ***<\/div> \n \n\n<p>As a valued customer we want you and your recipients to be satisfied with your purchase.  If AG&B has made an error in the processing\/filling of your order or if the product has arrived damaged or has not arrived at all we urge your to file a claim within <strong>5 business days<\/strong>.<\/p>\n\n<p><strong>Please Note: – Substitutions are not errors:<\/strong><\/p>\n<p>Difference in product packaging – <em>Not all packaging may look identical to the products photographed as packaging colors and shapes change quite frequently.<\/em><\/p>\n<p>Substitutions – <em>We reserve the right to make substitutions and do find the need to at various times throughout the year.<\/em><\/p>\n\n<h3>Return Process (Damaged\/Lost)<\/h3>:\n<ol>\n<li>\n<strong>Document Your Claim <\/strong>-\n<p><strong><em>For Damages:<\/em><\/strong>  We request customers that receive products that are damaged to send photos of what was received.  This is necessary for AG&B to file a claim with the Carrier.<\/p>\n<p><strong><em>For Lost in Transit: <\/em><\/strong>   If your order never arrived please contact us immediately so we may file a claim with the Carrier. No proof is required only your order\/tracking #.<\/p>\n<\/li>\n<li>\n<strong>Submit Your Claim –<\/strong> Please submit your claim by creating a  Support Ticket Here .  Claims cannot be accepted by phone.<\/li>\n<li>\n<strong>Re-Order if Needed –<\/strong> Both Damaged and Lost Claims are placed directly with the Carriers and can typically take between 3-5 business days to complete an investigation.  If a replacement order is needed we require that you place a new order with payment.<\/li>\n<li>\n<strong>Claim Refund or Replacement – <\/strong> Once your claim has been authorized by the Carrier AG&B will refund your original purchase + shipping charges (if applicable) OR re-ship new merchandise if you have not already re-ordered.<\/li>\n<hr>\n\n<h3>No Fault Returns<\/h3>\n<h4>You may return new, unopened products that is in its original packaging within 5 business days.<\/h4>\n<ol>\n <li>The product must be unopened and in its original condition.<br>\n<em>(FDA regulations prevents us from accepting returns once a Giftbasket is opened due to many containing perishable items such as food, flowers, wine, and other such products. )<\/em>\n<\/li> \n <li>The product must be retrievable.<\/li>\n<li> A 20% Restocking fee + Return Shipping Cost will be assessed.<\/li>\n<\/ol>\n \n\n<p><em>Authorized Returns for any reason other than damages, shipping errors, or lost in transit will incur a 20% restocking fee with return shipping at the customers expense.<\/em><\/p>\n<hr>\n<\/ol>","tab4heading":"Privacy Policy","tab4content":"<p><strong>Information Collection, Use, and Sharing<\/strong><\/p>\n<p>We are the sole owners of the information collected on this site. We only have access to\/collect information that you voluntarily give us via email or other direct contact from you.<strong> WE WILL NOT SELL OR RENT THIS INFORMATION TO ANYONE.<\/strong><\/p>\n<p>We will use your information to respond to you, regarding the reason you contacted us. We will not share your information with any third party outside of our organization, other than as necessary to fulfill your request, e.g. to ship an order.<\/p>\n<hr>\n<p><strong>Your Access to and Control Over Information<\/strong><\/p>\n<p>You may opt out of any future contacts from us at any time. You can do the following at any time by contacting us via the email address or phone number given on our website:<\/p>\n<ul>\n<li>See what data we have about you, if any.<\/li>\n<li>Change\/correct any data we have about you.<\/li>\n<li>Have us delete any data we have about you.<\/li>\n<li>Express any concern you have about our use of your data.<\/li>\n<\/ul>\n<p><strong>Security<\/strong><\/p>\n<div>We take precautions to protect your information. When you submit sensitive information via the website, your information is protected both online and offline.<br>\nWherever we collect sensitive information (such as credit card data), that information is encrypted and transmitted to us in a secure way. You can verify this by looking for a closed lock icon at the bottom of your web browser, or looking for “https” at the beginning of the address of the web page.<br>\nWhile we use encryption to protect sensitive information transmitted online, we also protect your information offline. Only employees who need the information to perform a specific job (for example, billing or customer service) are granted access to personally identifiable information. The computers\/servers in which we store personally identifiable information are kept in a secure environment.<br>\n<\/div>\n<hr>\n<p><strong>Orders<\/strong><\/p>\n<p>We request information from you on our order form. To buy from us, you must provide contact information (like name and shipping address) and financial information (like credit card number, expiration date). This information is used for billing purposes and to fill your orders. If we have trouble processing an order, we’ll use this information to contact you<\/p>"}}},"order":["main"]}