{"sections":{"main":{"type":"page-about-us-new","settings":{"asidemenu":"corporate","abtheading":"<p><span>OUR STORY!<\/span>who we are and where we’re headed …<\/p>","heading2":"Dear Valued Shoppers:","leftcontent":"<p><strong><span>A<\/span>merican Gifts & Baskets<\/strong> is a family-owned retailer of superior quality Gift Baskets. Our inspiration derived from a tradition of giving uniquely sourced gifts such as holiday gift towers, halloween basket, etc. to our family and friends on special occasions. We started our Journey in 2011 as a hobby by beginning to offer gift baskets and design services locally. Slowly but certainly, we began to build a customer base, and in 2015 decided to go national with AmericanGiftsandBaskets.com.<\/p>\n<p>Our team is committed to serving your needs for any Occasion. We welcome the opportunity to earn your business! \nAG&B is your source for the best selection of extraordinary handcrafted Gift Baskets, Wine Gifts, Corporate & Hospitality Gifts.  Whether your looking to purchase distinctive corporate gifts or for friends and family, we have unique products to suit your taste & budget.<\/p>","righttext":"<p><em>” Our inspiration derived from a tradition of giving uniquely sourced gifts “<\/em><\/p>"}},"65997a72-37f2-45d3-8b98-139f8647606f":{"type":"btn-with-text","settings":{"text":"Shop our store of over 1500 quality gift baskets for every Occasion!","btnlink":"shopify:\/\/pages\/search-results-page","btntext":"SHOP OUR BASKETS"}},"e8576f0c-9eea-4235-a0af-c6f3eee77578":{"type":"image-with-text","settings":{"image":"shopify:\/\/shop_images\/baskets-1.jpg","layout":"left","title":"Why AG&B?","text":"<p>Let’s face it! shopping for the perfect gift is time-consuming and can get frustrating, especially when that special occasion is right around the corner. A gift basket filled with the right products can save the day for a variety of occasions – Mothers Day, Fathers Day, Birthdays, Valentines Day, Christmas, Graduations, Corporate Occasions, and much more.<\/p><p>AG&B also allows you to personalize your gift basket by displaying a written message for your recipient.<\/p><p>We have value-priced gift baskets & gift towers for all occasions! Including corporate gift baskets, anniversary gift baskets, Halloween basket, feel better friend, coke gift basket, newborn basket, birthday gift baskets, gourmet gift baskets, chocolate gift baskets, holiday gift baskets, fruit baskets, coffee gift baskets & tea gift baskets. With many themes to choose from, you’re sure to find the perfect gift basket!<\/p><p>Beautiful Gift Baskets & Delicious Products<\/p><p>Our wine gift baskets, movie gift basket, fruit baskets, chocolate gifts, and so much more are all presented in a wide variety of keepsake baskets and containers, in styles suited for both him and her, designed to provide lasting use and enjoyment long after the treats and sweets inside have been devoured. Virtually all of our gifts are hand-tied with satin ribbon and shipped with complimentary cards with your greeting.<\/p><p>Trust AG&B with Your Gift Basket Delivery<\/p><p>Need to send a last-minute gift quickly? Even if it’s on a Holiday maximum of our gift shop with the same day or next day delivery. We also offer expedited shipping options that allow you not to miss that special occasion!<\/p>","button_label":"","button_link":""}}},"order":["main","65997a72-37f2-45d3-8b98-139f8647606f","e8576f0c-9eea-4235-a0af-c6f3eee77578"]}